pascal-4.0/tutorials/surfaceTracking/newInterTrackFoam/capillarity3DoneFluid/0/contactAngle
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       edgeScalarField;
    object      contactAngle;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    sideWalls
    {
        type            calculated;
        value           uniform 120;
//         value           uniform 90;
    }
}


// ************************************************************************* //
