pascal-4.0/tutorials/surfaceTracking/newInterTrackFoam/capillarity3DoneFluid/constant/interTrackProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      interTrackProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

settings
{
    debug                   1;

    region0
    {
        volumeForce         false;
        turbulence          false;

        UpCoupled           false;
        UEqnVolumeForce     false;
        snGradpFromFlux     true;
    }
}

storage
{
    region0
    {
        F                  "calculated";
        turbulence         "default";
    }
}

// ************************************************************************* //
